/******************************************************************************/
/* ファイル名 : mx6eapp_pt_mainloop.h                                         */
/* 機能概要   : PTネットワークメインループ関数 ヘッダファイル                 */
/* 修正履歴   : 2016.06.10 S.Anai 新規作成                                    */
/*                                                                            */
/* ALL RIGHTS RESERVED, COPYRIGHT(C) FUJITSU LIMITED 2016                     */
/******************************************************************************/
#ifndef __MX6EAPP_PT_MAINLOOP_H__
#   define __MX6EAPP_PT_MAINLOOP_H__

////////////////////////////////////////////////////////////////////////////////
// 外部関数プロトタイプ宣言
////////////////////////////////////////////////////////////////////////////////
bool                            mx6e_pt_mainloop(mx6e_handler_t * handler);

#endif												// __MX6EAPP_PT_MAINLOOP_H__
