/******************************************************************************/
/* ファイル名 : mx6eapp_print_packet.h                                        */
/* 機能概要   : デバッグ用パケット表示関数 ヘッダファイル                     */
/* 修正履歴   : 2016.06.10 S.Anai 新規作成                                    */
/*                                                                            */
/* ALL RIGHTS RESERVED, COPYRIGHT(C) FUJITSU LIMITED 2016                     */
/******************************************************************************/
#ifndef __MX6EAPP_PRINT_PACKET_H__
#   define __MX6EAPP_PRINT_PACKET_H__

////////////////////////////////////////////////////////////////////////////////
// 外部関数プロトタイプ宣言
////////////////////////////////////////////////////////////////////////////////
void                            mx6e_print_packet(char *packet);

#endif												// __MX6EAPP_PRINT_PACKET_H__
